app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @songs = Song.where(artist_id: params[:artist_id])
      if @songs.empty?
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? LIMIT ?  [["artist_id", 5], ["LIMIT", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      @song = Song.find_by(id: params[:id], artist_id: params[:artist_id])

      unless @song
        # flash[:alert] = "Song not found."
        redirect_to artist_songs_path(Artist.find(params[:artist_id])), alert: "Song not found."
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? AND "songs"."artist_id" = ? LIMIT ?  [["id", 7], ["artist_id", 5], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]